tutorials/rStatAnalysis/testingLargeIncompleteDataBases/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)			cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,U)      				bounded Gauss linearUpwindV grad(U);
    
    
    div((nuEff*dev2(T(grad(U)))))           Gauss linear;
    div((nuEff*dev(T(grad(U))))) 			Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default			corrected;
}

fluxRequired
{
    default         no;
    p               ;
    Phi             ;
}


// ************************************************************************* //
