tutorials/rStatAnalysis/testingLargeIncompleteDataBases/Allrun
#!/bin/bash
#
# run the case

./meshIt

./run

./post
